TexasInstruments/mspm0-sdk/examples/nortos/LP_MSPM0G5187/driverlib/empty_driverlib_src/ti/driverlib/dl_rtc_common.h
 *  @param[in]  rtc_common Pointer to the register overlay for the peripheral
 *  @param[in]  tsEventMask  Bit mask of events to check. Logical OR of
 *                           @ref DL_RTC_COMMON_TIME_STAMP_EVENT_CAUSE.
 *
 *  @return     The cause of the time stamp event
 *
 *  @retval     Logical OR of @ref DL_RTC_COMMON_TIME_STAMP_EVENT_CAUSE values
 */
__STATIC_INLINE uint32_t DL_RTC_Common_getTimeStampEventCause(
    const RTC_Regs *rtc_common, uint32_t tsEventMask)
{
    return (rtc_common->TSSTAT & tsEventMask);
}
#endif

/**
 *  @brief      Initializes the settings to operate the RTC Common in Calendar mode.
 *
 *  @param[in]  rtc_common               Pointer to the register overlay for the
 *                                  RTC Common peripheral
 *  @param[in]  calendarTime        Structure containing the values for the
 *                                  Calendar to be initialized to
 *  @param[in]  formatSelect        Selectable format the RTC Common peripheral will
 *                                  provide time in.
 *                                  @ref DL_RTC_COMMON_FORMAT
 *
 */
void DL_RTC_Common_initCalendar(RTC_Regs *rtc_common,
    DL_RTC_Common_Calendar calendarTime, DL_RTC_COMMON_FORMAT formatSelect);

/**
 *  @brief      Returns the Calendar Time
 *
 *  @param[in]  rtc_common             Pointer to the register overlay for the
 *                                  RTC Common peripheral
 *
 * This function returns the current Calendar Time in the form of a Calendar
 * structure.
 * The time returned will be in the previously selected format.
 *
 *  @return            A Calendar structure containing the current time.
 *
 */
DL_RTC_Common_Calendar DL_RTC_Common_getCalendarTime(
    const RTC_Regs *rtc_common);

/**
 *  @brief      Set calendar alarm 1
 *
 *  @param[in]  rtc_common             Pointer to the register overlay for the
 *                                  RTC Common peripheral
 *  @param[in]  alarmTime           Structure containing the values for the
 *                                  alarm to be set to
 *
 */
void DL_RTC_Common_setCalendarAlarm1(
    RTC_Regs *rtc_common, DL_RTC_Common_CalendarAlarm alarmTime);

/**
 *  @brief      Get calendar alarm 1
 *
 *  @param[in]  rtc_common               Pointer to the register overlay for the
 *                                  RTC Common peripheral
 *
 *  @return     A Alarm structure containing the set time for alarm 1
 *
 */
DL_RTC_Common_CalendarAlarm DL_RTC_Common_getCalendarAlarm1(
    const RTC_Regs *rtc_common);

/**
 *  @brief      Enable calendar alarm 1
 *
 *  @param[in]  rtc_common               Pointer to the register overlay for the
 *                                  RTC Common peripheral
 *
 */
void DL_RTC_Common_enableCalendarAlarm1(RTC_Regs *rtc_common);

/**
 *  @brief      Disable calendar alarm 1
 *
 *  @param[in]  rtc_common               Pointer to the register overlay for the
 *                                  RTC Common peripheral
 *
 */
void DL_RTC_Common_disableCalendarAlarm1(RTC_Regs *rtc_common);

/**
 *  @brief      Set calendar alarm 2
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *  @param[in]  alarmTime           Structure containing the values for the
 *                                  alarm to be set to
 *
 */
void DL_RTC_Common_setCalendarAlarm2(
    RTC_Regs *rtc_common, DL_RTC_Common_CalendarAlarm alarmTime);

/**
 *  @brief      Get calendar alarm 2
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 *  @return     A Alarm structure containing the set time for alarm 2
 *
 */
DL_RTC_Common_CalendarAlarm DL_RTC_Common_getCalendarAlarm2(
    const RTC_Regs *rtc_common);

/**
 *  @brief      Enable calendar alarm 2
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 */
void DL_RTC_Common_enableCalendarAlarm2(RTC_Regs *rtc_common);

/**
 *  @brief      Disable calendar alarm 2
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 */
void DL_RTC_Common_disableCalendarAlarm2(RTC_Regs *rtc_common);

#ifdef __MSPM0_HAS_RTC_A__
/**
 *  @brief      Set the sources to trigger a time stamp capture event
 *
 *  The timestamp event can be triggered by an edge detection of any of the
 *  tamper IO. This API sets which source(s) will trigger a time stamp capture
 *  event.
 *
 *  @param[in]  rtc_common      Pointer to the register overlay for the RTC Common peripheral
 *  @param[in]  sourceMask  The sources that can trigger a time stamp capture
 *                          event. Logical OR of
 *                          @ref DL_RTC_COMMON_TIME_STAMP_EVENT_SOURCE
 */
__STATIC_INLINE void DL_RTC_Common_setTimeStampEventSource(
    RTC_Regs *rtc_common, uint32_t sourceMask)
{
    rtc_common->TSCTL |= (RTC_TSCTL_KEY_UNLOCK_W | sourceMask);
}

/**
 *  @brief      Get the sources that can trigger a time stamp capture event
 *
 *  @param[in]  rtc_common      Pointer to the register overlay for the RTC Common peripheral
 *  @param[in]  sourceMask  The sources that can trigger a time stamp capture
 *                          event. Logical OR of
 *                          @ref DL_RTC_COMMON_TIME_STAMP_EVENT_SOURCE
  *
 *  @return     The sources of the time stamp event
 *
 *  @retval     Logical OR of @ref DL_RTC_COMMON_TIME_STAMP_EVENT_SOURCE values
 */
__STATIC_INLINE uint32_t DL_RTC_Common_getTimeStampEventSource(
    const RTC_Regs *rtc_common, uint32_t sourceMask)
{
    return (rtc_common->TSCTL & sourceMask);
}

/**
 *  @brief      Returns the Calendar Time of the Time Stamp
 *
 *  @param[in]  rtc_common             Pointer to the register overlay for the
 *                                     RTC Common peripheral
 *
 * This function returns the current Calendar Time of the Time Stamp
 * in the form of a Calendar structure.
 * The time returned will be in the previously selected format from
 * @ref DL_RTC_Common_setClockFormat, one of @ref DL_RTC_COMMON_FORMAT.
 *
 *  @return            @ref DL_RTC_Common_Calendar containing the time stamp
 *
 */
DL_RTC_Common_Calendar DL_RTC_Common_getTimeStampCalendar(
    const RTC_Regs *rtc_common);

/**
 *  @brief      Set the capture method when a time stamp capture event occurs
 *
 *  The timestamp event can be triggered by an edge detection of any of the
 *  tamper IO. This API sets whether the first or last occurrence of the event
 *  is captured.
 *
 *  @param[in]  rtc_common   Pointer to the register overlay for the RTC Common peripheral
 *  @param[in]  capture  The capture method for the time stamp event.
 *                       One of @ref DL_RTC_COMMON_TIME_STAMP_EVENT_CAPTURE
 */
__STATIC_INLINE void DL_RTC_Common_setTimeStampEventCapture(
    RTC_Regs *rtc_common, DL_RTC_COMMON_TIME_STAMP_EVENT_CAPTURE capture)
{
    DL_Common_updateReg(&rtc_common->TSCTL,
        (RTC_TSCTL_KEY_UNLOCK_W | (uint32_t) capture),
        (RTC_TSCTL_TSCAPTURE_MASK | RTC_TSCTL_KEY_MASK));
}

/**
 *  @brief      Get the capture method when a time stamp capture event occurs
 *
 *  The timestamp event can be triggered by an edge detection of any of the
 *  tamper IO. This API sets whether the first or last occurrence of the event
 *  is captured.
 *
 *  @param[in]  rtc_common   Pointer to the register overlay for the RTC Common peripheral
  *
 *  @return     The capture method for a time stamp capture event
 *
 *  @retval     One of @ref DL_RTC_COMMON_TIME_STAMP_EVENT_CAPTURE
 */
__STATIC_INLINE DL_RTC_COMMON_TIME_STAMP_EVENT_CAPTURE
DL_RTC_Common_getTimeStampEventCapture(const RTC_Regs *rtc_common)
{
    uint32_t capture = (rtc_common->TSCTL & RTC_TSCTL_TSCAPTURE_MASK);

